{
  "details.close-button": "Close",
  "profile-page.title": "Profile",
  "profile-page.img-alt": "Daniel Cruz photo",
  "profile-page.principal-message": "Hi there, I'm Daniel Cruz, a web developer with a focus on Frontend development. I want to help businesses improve their user experience and engagement.🚀{br}{br}I have 3 years of experience working with HTML, CSS, and JavaScript, and I've also worked with backend technologies like Node.js and Java concepts with Spring Boot. I'm familiar with AWS technologies like S3, EC2, and API Gateway as well. 🧠{br}{br}Currently, I'm working at a startup where I'm doing Fullstack development with Javascript and AWS technologies. My experience in the e-commerce world has given me some valuable insights to help clients and projects.{br}{br}My goal is to keep learning and improving in web development and hopefully become a software architect or lead a Frontend team someday. Let's build something great together! 💪",
  "working-xp-page.title": "Experience",
  "working-xp-page.principal-message": "I been working in web development 3 years ago.",
  "working-xp-page.company-sena": "I revolutionized my company's manual processes by using the Google API to generate reports, saving valuable time. Despite having to learn a new language, JavaScript, my innovation was a hit and transformed the way we worked. It's proof that with creativity and hard work. 💪",
  "working-xp-page.company-creaciones-digitales": "My role was a Frontend developer junior, we had to create user interfaces using web tools like HTML, CSS, and Javascript. We used two frameworks called Tailwindcss and Vuejs for the main project. This job gives me the first approach to remote work and the basis of coo-working.",
  "working-xp-page.company-blacksip": "This was the biggest company that I have worked for. I started with a Junior Backend Developer role because I applied for that job and had the required knowledge. However, the tech lead found a more fitting role for me as a Frontend Developer.{br}{br}This role was extremely important in the company since we used a low-code platform called Vtex. While this technology was robust, it had many known bugs. Frontend developers were in charge of 90% of the configurations and real customization for each client. As a result, I learned a lot of CSS tricks, and the foundations of Javascript and SCRUM.",
  "working-xp-page.company-bemaster": "This is my current company, and I love the new horizon of challenges that I have here, as well as the great work environment. I started as a Frontend Developer, but I also work on backend projects when needed.{br}{br}I'm learning AWS technologies and applying them in real projects, which is incredible. In my previous jobs, I didn't have enough training or the opportunity to apply my knowledge to different scenarios. I really enjoy studying to improve my skills and exceed expectations, and it's all because of the exciting work environment that I have here.",
  "projects.view-code": "View code",
  "projects.demo": "Demo",
  "knowledge-page.title": "Knowledge",
  "knowledge-page.react": "I'm a React enthusiast with 1 and a half years of experience working with this library. During this time, I've learned all the ins and outs of React.{br}{br}To improve my abilities, I've been working on personal projects using React, pushing myself to experiment with new features. And, to take my expertise to the next level, I've been using Typescript with React to minimize errors and Ensure that my code is the best it can be. 🔥{br}{br}I'm always excited to try new things, and learn more about React and its new features.\n",
  "knowledge-page.javascript": "I've been in the world of web development for 4 years now and it's safe to say that JavaScript I use this language all the time.. This language is so versatile that it allows me to explore beyond just web development. I've used JavaScript to create tests with Arduino boards, build sensors with graphical representations, and even connect to my room lights with simple robots, all thanks to the amazing Jonny-Five library.🤖{br}{br}To ensure that I am always up to date with the latest JavaScript practices, I make it a daily routine to read a chapter of the \"Clean Code in JavaScript\" by James Padolsey. This book has helped me sharpen my skills and improve my knowledge of this incredible language, which has opened up a world of possibilities for me.{br}{br}I am always excited to explore new ways to use JavaScript and apply it in different scenarios, and I look forward to what the future holds for this amazing language.",
  "knowledge-page.typescript": "<strong>Confession time:</strong> When I first encountered Typescript, I was totally intimidated by it. I had no idea what it was or how to use it, and it felt like a real headache. But let me tell you, once I took the time to dive into it, I realized how significant it is! Nowadays, it's one of my go-to tools for creating more maintainable and reliable projects.{br}{br}Typescript has taught me some hard lessons about bad coding practices, and the benefits of using strong data types are undeniable. It has made me a much more efficient coder, and I can honestly say that it's better than I ever imagined.",
  "knowledge-page.node": "I started using Node.js to manipulate files and process data, which I found to be incredibly fast and easy to work with. This led me to explore Express-based projects and expand my knowledge of backend development, learning about concepts like REST, HTTP codes, cookies, headers, params, query params, and authentication.  With the arrival of Deno 🦕, I now enjoy an even smoother development experience.",
  "knowledge-page.html": "HTML is the basis of web development. I learned with legacy concepts like table-driven design 🫠. In the beginning, that was boring, but with new knowledge about the web and particular tags, I started to understand the importance of this language in topics like SEO, design patterns, and tricks. Every time I can, I read the browser tag compatibility to add some new tags or attributes. One of my favorites that I have had the pleasure to use was the details element to create an accessible and native pop-up/modal.",
  "knowledge-page.figma": "I learned this design tool on my own. I want to create my own design systems and make my own interfaces. I learned about UX/UI and I try to apply it in many places of my work. As a frontend developer, my priority is to offer the best UX that I can, with beautiful interfaces, animations, accessibility, and performance. All of this comes from design, so I try to improve my perfectionist eye to help the design team from the dev team.",
  "knowledge-page.css": "This is one of my favorite parts of being a Frontend developer: CSS! It's our weapon to create unforgettable sites on the web. I have so much fun with CSS battles and games, improving my skills with unusual CSS uses. This gives me a solid understanding of how CSS works and how to work more consistently with it.",
  "knowledge-page.git": "SVC or System Version Control is so important to avoid irreversible mistakes that we may make.{br}{br}I experienced the power of Git when I started at my first company where we had three developers working on one project. We usually edited the same files because the product required it. I resolved some problems caused by overwriting done by a partner, and we knew what he changed because of a diff. 🫠{br}{br}Other awesome uses to Git is GitHub and pull requests, because this allows me to check the code of another dev, and give him a comment, suggestion or congratulations. My future is lead a team, and the positive and constructive feedback is one of my best tools to throw me to that place.",
  "knowledge-page.jira": "In my opinion, Jira is the go-to tool for task management. I use two types of boards in Jira: Kanban (best for ensuring task fulfillment) and Scrum-based boards (the most commonly used). I feel really comfortable with this tool and the mindset behind it. I always prioritize the time to create tasks and estimations because it is the best moment to discuss the pros and cons of an idea and work on it.",
  "knowledge-page.postman": "Postman is a simple but practical tool to test your services, API's, endpoints, GraphQL endpoints and create a fast and solid documentation about them. Postman allows you to create a scripts to manipulate the request before running it, other cool features like enviroments, workspaces, and forks make this an indispensable tool.",
  "contact-page.title": "Contact",
  "contact-page.main-content": "If you want to contact me about a project or a role that I might fit, I will be willing to meet and talk about it. Please, do not hesitate to use the following options to contact me. 😉",
  "contact-page.input-label": "Leave me your email!",
  "contact-page.input-placeholder": "severus_snape@hogwarts.com",
  "contact-page.send-me-message": "...or contact me through my social networks"
}
