{
  "details.close-button": "Cerrar",
  "profile-page.title": "Perfil",
  "profile-page.img-alt": "Foto de Daniel Cruz",
  "profile-page.principal-message": "¡Hola! Soy Daniel Cruz, un desarrollador web enfocado en el desarrollo frontend. Mi objetivo es ayudar a las empresas a mejorar su experiencia de usuario y su compromiso con los clientes.🚀{br}{br} Tengo 3 años de experiencia trabajando con HTML, CSS y JavaScript, y también he trabajado con tecnologías backend como Node.js y conceptos de Java con Spring Boot. Además, estoy familiarizado con tecnologías de AWS como S3, EC2 y API Gateway.🧠{br}{br}Actualmente, trabajo en una startup donde hago desarrollo Fullstack con JavaScript y tecnologías de AWS. Mi experiencia en el mundo del comercio electrónico me ha brindado información valiosa para ayudar a los clientes y proyectos.{br}{br}Mi objetivo es seguir aprendiendo y mejorando en el desarrollo web y, con suerte, convertirme en arquitecto de software o liderar un equipo de desarrollo frontend en algún momento. ¡Construyamos algo genial juntos! 💪",
  "working-xp-page.title": "Experiencia",
  "working-xp-page.principal-message": "I been working in web development 3 years ago.",
  "working-xp-page.company-sena": "Revolutionicé los procesos manuales de mi empresa utilizando la API de Google para generar informes, lo que nos permitió ahorrar tiempo valioso. A pesar de tener que aprender un nuevo lenguaje, JavaScript, mi innovación fue un éxito y transformó la forma en que trabajábamos. Es una prueba de que con creatividad y trabajo duro, todo es posible.",
  "working-xp-page.company-creaciones-digitales": "Mi rol era la de desarrollador Frontend junior, donde tuvimos que crear interfaces de usuario utilizando herramientas web como HTML, CSS y JavaScript. Utilizamos dos frameworks llamados Tailwindcss y Vuejs para el proyecto principal. Este trabajo me brindó mi primera experiencia con el trabajo remoto y las bases de trabajo en equipo.",
  "working-xp-page.company-blacksip": "Esta fue la empresa más grande en la que trabajé. Comencé con un rol de Desarrollador Backend Junior porque me postulé para ese trabajo y tenía el conocimiento requerido. Sin embargo, el líder técnico encontró un rol más adecuado para mí como Desarrollador Frontend.{br}{br}Este rol fue extremadamente importante en la empresa, ya que utilizamos una plataforma de low-code llamada Vtex. Si bien esta tecnología era robusta, pero tenía muchos know bugs. Los desarrolladores Frontend estaban a cargo del 90% de las configuraciones y personalizaciones para cada cliente. Como resultado, aprendí muchos trucos de CSS, las bases de Javascript y de SCRUM.",
  "working-xp-page.company-bemaster": "Esta es mi empresa actual, me encanta el nuevo horizonte de desafíos que tengo aquí y el buen ambiente laboral que hay. Comencé como desarrollador Frontend, pero también trabajo en proyectos de backend cuando es necesario.{br}{br}Estoy aprendiendo tecnologías de AWS y aplicándolas en proyectos reales, lo cual es increíble. En mis trabajos anteriores, no tuve suficiente capacitación o la oportunidad de aplicar mis conocimientos a diferentes escenarios. Realmente disfruto estudiando para mejorar mis habilidades y superar las expectativas, y todo esto se debe al emocionante ambiente de trabajo que tengo aquí.",
  "projects.view-code": "Ver código",
  "projects.demo": "Demo",
  "knowledge-page.title": "Saberes",
  "knowledge-page.react": "Soy un entusiasta de React con 1 año y medio de experiencia trabajando con esta librería. Durante este tiempo, he aprendido todos los fundamentos de React. {br}{br}Para mejorar mis habilidades, he estado trabajando en proyectos personales utilizando React, empujándome a experimentar con nuevas características. Y, para llevar mi experiencia al siguiente nivel, he estado usando Typescript con React para minimizar errores y asegurarme de que mi código sea lo mejor posible. 🔥{br}{br}Siempre estoy emocionado de probar cosas nuevas y aprender más sobre React y sus nuevas características.",
  "knowledge-page.javascript": "Llevo 4 años en el mundo del desarrollo web y puedo decir que JavaScript es el lenguaje que uso todo el tiempo. Este lenguaje es tan versátil que me permite explorar más allá del desarrollo web. He utilizado JavaScript para crear pruebas con placas Arduino, construir sensores con representaciones gráficas e incluso conectar mis luces de habitación con simples robots, todo gracias a la increíble biblioteca Jonny-Five.🤖{br}{br}Para asegurarme de estar siempre actualizado con las últimas prácticas de JavaScript, tengo la rutina diaria de leer un capítulo de \"Clean Code in JavaScript\" de James Padolsey. Este libro me ha ayudado a perfeccionar mis habilidades y mejorar mi conocimiento de este increíble lenguaje, que ha abierto un mundo de posibilidades para mí.{br}{br}Siempre estoy emocionado por explorar nuevas formas de usar JavaScript y aplicarlo en diferentes escenarios, y espero con ansias lo que el futuro depara para este increíble lenguaje.",
  "knowledge-page.typescript": "<strong>Hora de la confesión:</strong> Cuando encontré Typescript por primera vez, me sentí totalmente intimidado. No tenía idea de qué era ni cómo usarlo, y parecía una verdadera molestia. Pero déjame decirte que, una vez que me tomé el tiempo para sumergirme en él, ¡me di cuenta de lo significativo que es! Hoy en día, es una de mis herramientas principales para crear proyectos más mantenibles y confiables.{br}{br}Typescript me ha enseñado duras lecciones sobre malas prácticas de codificación, y los beneficios de usar tipos de datos fuertes son innegables. Me ha convertido en un desarrollador mucho más eficiente, y honestamente puedo decir que es mejor de lo que nunca imaginé.",
  "knowledge-page.node": "Comencé a utilizar Node.js para manipular archivos y procesar datos, lo cual resultó ser increíblemente rápido y fácil de trabajar. Esto me llevó a explorar proyectos basados en Express y expandir mi conocimiento del desarrollo backend, aprendiendo conceptos como REST, códigos HTTP, cookies, encabezados, parámetros, parámetros de consulta y autenticación. Con la llegada de Deno 🦕, ahora disfruto de una experiencia de desarrollo aún más fluida.",
  "knowledge-page.html": "HTML es la base del desarrollo web. Aprendí con conceptos heredados como el diseño basado en tablas 🫠. Al principio eso era aburrido, pero con nuevos conocimientos sobre la web y etiquetas particulares, empecé a entender la importancia de este lenguaje en temas como SEO, patrones de diseño y trucos. Cada vez que puedo, leo la compatibilidad de etiquetas del navegador para agregar nuevas etiquetas o atributos. Uno de mis favoritos que he tenido el placer de usar fue el elemento \"details\" para crear una ventana emergente/modal accesible y nativa.",
  "knowledge-page.figma": "Yo aprendí esta herramienta de diseño por mi cuenta. Quiero crear mis propios sistemas de diseño y hacer mis propias interfaces. Aprendí acerca de UX/UI y trato de aplicarlo en muchos lugares de mi trabajo. Como desarrollador frontend, mi prioridad es ofrecer la mejor experiencia de usuario posible, con interfaces hermosas, animaciones, accesibilidad y rendimiento. Todo esto proviene del diseño, así que trato de mejorar mi ojo perfeccionista para ayudar al equipo de diseño desde el equipo de desarrollo.",
  "knowledge-page.css": "¡Esta es una de mis partes favoritas de ser un desarrollador Frontend: CSS! Es nuestra arma para crear sitios web inolvidables. Me divierto mucho con las batallas y los juegos de CSS, mejorando mis habilidades con usos poco comunes de CSS. Esto me da una comprensión sólida de cómo funciona CSS y cómo trabajar de manera más consistente con este.",
  "knowledge-page.git": "SVC o Sistema  de Control de Versiones es muy importante para evitar errores irreversibles que podríamos cometer.{br}{br}Experimenté el poder de Git cuando comencé en mi primera empresa donde teníamos tres desarrolladores trabajando en un proyecto. Solíamos editar los mismos archivos porque el producto lo requería. Resolví algunos problemas causados por la sobrescritura realizada por un compañero, y sabíamos lo que había cambiado gracias a un diff. 🫠{br}{br}Otro uso impresionante de Git es GitHub y los pull requests, ya que esto me permite revisar el código de otro desarrollador y darle un comentario, sugerencia o felicitación. Mi futuro es liderar un equipo, y el feedback positivo y constructivo es una de mis mejores herramientas para llegar a ese lugar.",
  "knowledge-page.jira": "En mi opinión, Jira es la herramienta ideal para la gestión de tareas. Utilizo dos tipos de tableros en Jira: Kanban (ideal para garantizar el cumplimiento de las tareas) y tableros basados en Scrum (los más utilizados). Me siento realmente cómodo con esta herramienta y la mentalidad detrás de ella. Siempre priorizo el tiempo para crear tareas y estimaciones porque es el mejor momento para discutir los pros y los contras de una idea y trabajar en esta.",
  "knowledge-page.postman": "Postman es una herramienta simple pero práctica para probar servicios, API, endpoints, endpoints de GraphQL y crear una documentación rápida y sólida sobre ellos. Postman te permite crear scripts para manipular la solicitud antes de ejecutarla. Otras características interesantes como entornos, espacios de trabajo y forks hacen que esta sea una herramienta indispensable.",
  "contact-page.title": "Contacto",
  "contact-page.main-content": "Si deseas contactarme acerca de un proyecto o un puesto en el que pueda encajar, estaré dispuesto a reunirnos y conversar al respecto. Por favor, no dudes en utilizar las siguientes opciones para contactarme.😉",
  "contact-page.input-label": "Leave me your email!",
  "contact-page.input-placeholder": "severus_snape@hogwarts.com",
  "contact-page.send-me-message": "...or contact me through my social networks"
}
